Revit 2027 API
Application.NewFaceArray Method
Creates a new instance of a face array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FaceArray NewFaceArray()
Public Function NewFaceArray As FaceArray
public:
FaceArray^ NewFaceArray()
member NewFaceArray : unit -> FaceArray
Return Value
FaceArray
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace